karthiknataraj547/Water-pump-controller/firmware/arduino_ide/build_esp32/sketch/ESP32_Main_Gateway.ino.cpp
#line 1 "D:\\water pump\\firmware\\arduino_ide\\ESP32_Main_Gateway\\ESP32_Main_Gateway.ino"
/*
 * ==============================================================================
 * HydroPulse IoT Water Pump Controller & Gateway - ESP32 Main Node Firmware
 * ==============================================================================
 * Architecture: ESP32 FreeRTOS Dual-Core System
 * Core 0: TaskNetwork (Wi-Fi, MQTT with LWT, HTTP Backend API, Status Heartbeat)
 * Core 1: TaskControl (Relay Soft-Start, Manual Switching, Safety Interlocks, Reset)
 *
 * Hardware Peripherals:
 *   - Relay Module (Active HIGH)               -> GPIO 23
 *   - Manual Push Button (Active LOW)          -> GPIO 19
 *   - Emergency Stop Switch (Active LOW)       -> GPIO 18
 *   - Factory Hard Reset Button (BOOT / GPIO 0)-> GPIO 0  (Hold 1.2s at boot / 1.5s runtime)
 *   - Blue Network Status LED                  -> GPIO 2
 *   - Green Pump Running LED                   -> GPIO 4
 *   - Alert Buzzer                             -> GPIO 5
 *
 * Communications:
 *   - BLE GATT Provisioning (UUIDs aligned with Flutter Mobile App)
 *   - Wi-Fi Station with persistent auto-reconnect & max RF transmit power
 *   - Global Cloud MQTT Broker with Last Will & Testament (LWT) on 'pump/status'
 *   - ESP-NOW Central Hub receiving telemetry from ESP8266 Sub Node (CRC16 check)
 *   - Backend HTTP API Telemetry Posting (REST failover / sync)
 *
 * Required Libraries (Install via Arduino Library Manager):
 *   1. "PubSubClient" by Nick O'Leary (v2.8+)
 *   2. "ArduinoJson" by Benoit Blanchon (v6.x or v7.x)
 *   (BLE and ESP-NOW are built into the ESP32 board package automatically)
 * ==============================================================================
 */

#include <Arduino.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <esp_idf_version.h>
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include <HTTPClient.h>
#include "soc/soc.h"
#include "soc/rtc_cntl_reg.h"

// Built-in ESP32 BLE Stack
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>

// ==============================================================================
// 1. HARDWARE PIN DEFINITIONS & CONSTANTS
// ==============================================================================
#define PIN_RELAY_PUMP         23   // Main Pump Relay Pin (GPIO 23)
#define RELAY_ACTIVE_LOW       false// Set to 'true' for Active-LOW relay modules, 'false' for Active-HIGH
#define PIN_MANUAL_BUTTON      19   // Manual toggle push button (Active LOW with pullup)
#define PIN_EMERGENCY_STOP     18   // Emergency cutoff switch (Active LOW with pullup)
#define PIN_HARD_RESET         0    // Factory Hard Reset button (BOOT Button / GPIO 0)
#define PIN_LED_NETWORK        2    // Blue network LED (Blinks when offline, solid when connected)
#define PIN_LED_PUMP           4    // Green pump running LED
#define PIN_BUZZER             5    // Piezo alert buzzer

#define FIRMWARE_VERSION       "2.0.0"
#define DEFAULT_DEVICE_PREFIX  "esp32_pump_"
#define BLE_DEVICE_PREFIX      "PumpController-"
#define NVS_NAMESPACE          "pump_config"

// Networking & Cloud Defaults
#define DEFAULT_MQTT_BROKER    "broker.emqx.io"
#define DEFAULT_MQTT_PORT      1883
#define STATUS_REPORT_INTERVAL 2000     // 2 seconds dedicated Main Node heartbeat
#define SUB_NODE_TIMEOUT_MS    4000     // 4s timeout for 300ms ESP8266 Sub Node streaming
#define MAX_RUN_TIME_LIMIT_MS  1800000  // 30 minutes continuous max runtime safety limit
#define BACKEND_API_URL        "http://localhost:4000/api/v1/telemetry" // Configurable API endpoint

// BLE Provisioning UUIDs (Matching Flutter App)
#define SERVICE_UUID_PROV      "19B10000-E8F2-537E-4F6C-D104768A1214"
#define CHAR_UUID_WIFI_SSID    "19B10001-E8F2-537E-4F6C-D104768A1214"
#define CHAR_UUID_WIFI_PASS    "19B10002-E8F2-537E-4F6C-D104768A1214"
#define CHAR_UUID_AUTH_TOKEN   "19B10003-E8F2-537E-4F6C-D104768A1214"
#define CHAR_UUID_PROV_STATUS  "19B10004-E8F2-537E-4F6C-D104768A1214"
#define CHAR_UUID_DEVICE_INFO  "19B10005-E8F2-537E-4F6C-D104768A1214"

// ==============================================================================
// 2. BINARY TELEMETRY PACKET (ESP-NOW PROTOCOL)
// ==============================================================================
#pragma pack(push, 1)
struct SensorTelemetryPacket {
  uint16_t header;        // 0xAA55
  char     nodeId[16];    // e.g. "tank_node_001"
  uint32_t sequence;      // Incrementing counter
  float    waterLevelPct; // 0.0 - 100.0%
  float    waterVolumeL;  // Liters
  float    flowRateLpm;   // Liters / minute
  float    waterTempC;    // Degrees C
  float    tdsPpm;        // Total Dissolved Solids
  float    batteryVoltage;// Volts (3.7V - 4.2V)
  uint8_t  nodeStatus;    // 0: OK, 1: Low Battery, 2: Sensor Error
  uint16_t checksum;      // CRC16-CCITT
};
#pragma pack(pop)

// ==============================================================================
// 3. GLOBAL OBJECTS & RUNTIME STATE
// ==============================================================================
Preferences prefs;
WiFiClient espClient;
PubSubClient mqttClient(espClient);

BLEServer*         pBleServer = nullptr;
BLECharacteristic* pStatusChar = nullptr;
bool               bleClientConnected = false;
bool               bleProvisioningActive = false;

String deviceId = "";
String storedSSID = "";
String storedPass = "";
String storedBackendUrl = BACKEND_API_URL;
String incomingSsid = "";
String incomingPass = "";
String incomingToken = "";

// Operational Modes: AUTO (autonomous levels), MANUAL (app/button direct), SCHEDULE
String systemMode = "AUTO";
float autoStartLevel = 25.0f;
float autoStopLevel = 95.0f;
bool dryRunProtectionEnabled = true;

// State variables
bool pumpRunning = false;
bool emergencyStopped = false;
unsigned long pumpStartTime = 0;

// Non-blocking Command Queue & Status Notification Flags
volatile bool requestedPumpState = false;
volatile bool hasPendingPumpCommand = false;
String pendingCmdReason = "";
String pendingCmdId = "";
volatile bool notifyMqttStatusUpdate = false;

// Sub node telemetry cache (-1 sentinel = no sensor data yet)
float currentLevelPct = -1.0f;
float currentVolumeL = 0.0f;
float currentFlowRateLpm = 0.0f;
float currentTempC = 0.0f;
float currentTdsPpm = 0.0f;
float currentBatteryV = 0.0f;
uint32_t lastPacketSeq = 0;
unsigned long lastSensorPacketTime = 0;

// FreeRTOS Task Handles
TaskHandle_t TaskNetworkHandle = NULL;
TaskHandle_t TaskControlHandle = NULL;

// Cloud Broker Failover Pool
const char* CLOUD_BROKERS[] = {"broker.emqx.io", "broker.hivemq.com", "test.mosquitto.org"};
int currentBrokerIdx = 0;
unsigned long lastMqttRetry = 0;

// Forward Declarations
void updateBleStatus(const String &state, const String &ip = "", const String &error = "");
bool connectWifi(const String &ssid, const String &pass);
void setPumpState(bool state, const String &reason);
void executeFactoryReset();
void sendHttpBackendTelemetry();
uint16_t calculateCRC16(const uint8_t *data, size_t len);

// ==============================================================================
// 4. CRC16-CCITT CHECKSUM CALCULATION
// ==============================================================================
#line 237 "D:\\water pump\\firmware\\arduino_ide\\ESP32_Main_Gateway\\ESP32_Main_Gateway.ino"
void updateBleStatus(const String &state, const String &ip, const String &error);
#line 253 "D:\\water pump\\firmware\\arduino_ide\\ESP32_Main_Gateway\\ESP32_Main_Gateway.ino"
void startBleProvisioning();
#line 319 "D:\\water pump\\firmware\\arduino_ide\\ESP32_Main_Gateway\\ESP32_Main_Gateway.ino"
void stopBleProvisioning();
#line 451 "D:\\water pump\\firmware\\arduino_ide\\ESP32_Main_Gateway\\ESP32_Main_Gateway.ino"
void mqttCallback(char* topic, byte* payload, unsigned int length);
#line 555 "D:\\water pump\\firmware\\arduino_ide\\ESP32_Main_Gateway\\ESP32_Main_Gateway.ino"
void onEspNowDataRecv(const esp_now_recv_info_t *info, const uint8_t *incomingData, int len);
#line 586 "D:\\water pump\\firmware\\arduino_ide\\ESP32_Main_Gateway\\ESP32_Main_Gateway.ino"
void TaskNetwork(void *pvParameters);
#line 776 "D:\\water pump\\firmware\\arduino_ide\\ESP32_Main_Gateway\\ESP32_Main_Gateway.ino"
void TaskControl(void *pvParameters);
#line 873 "D:\\water pump\\firmware\\arduino_ide\\ESP32_Main_Gateway\\ESP32_Main_Gateway.ino"
void setup();
#line 1004 "D:\\water pump\\firmware\\arduino_ide\\ESP32_Main_Gateway\\ESP32_Main_Gateway.ino"
void loop();
#line 170 "D:\\water pump\\firmware\\arduino_ide\\ESP32_Main_Gateway\\ESP32_Main_Gateway.ino"
uint16_t calculateCRC16(const uint8_t *data, size_t len) {
  uint16_t crc = 0xFFFF;
  for (size_t i = 0; i < len; i++) {
    crc ^= (uint16_t)data[i] << 8;
    for (uint8_t j = 0; j < 8; j++) {
      if (crc & 0x8000) crc = (crc << 1) ^ 0x1021;
      else crc <<= 1;
    }
  }
  return crc;
}

// ==============================================================================
// 5. BLE PROVISIONING ENGINE
// ==============================================================================
class MyServerCallbacks: public BLEServerCallbacks {
  void onConnect(BLEServer* pServer) {
    bleClientConnected = true;
    Serial.println("[BLE] Central smartphone connected!");
    updateBleStatus("CONNECTED_BLE");
  }

  void onDisconnect(BLEServer* pServer) {
    bleClientConnected = false;
    Serial.println("[BLE] Central smartphone disconnected.");
    if (bleProvisioningActive) {
      BLEDevice::startAdvertising();
    }
  }
};

