karthiknataraj547/Water-pump-controller/firmware/arduino_ide/build_esp32/sketch/ESP32_Main_Gateway.ino.cpp
  // Request asynchronous status broadcast in TaskNetwork loop
  notifyMqttStatusUpdate = true;
}

// ==============================================================================
// 8. FACTORY HARD RESET HANDLER (4-WAY TRIGGER)
// ==============================================================================
void executeFactoryReset() {
  Serial.println("\n*******************************************************");
  Serial.println("[FACTORY RESET] EXECUTING COMPLETE HARDWARE WIPE...");
  Serial.println("[FACTORY RESET] Erasing NVS Flash & SDK Wi-Fi Credentials...");
  Serial.println("*******************************************************\n");

  // Audible & visual confirmation (6 beeps and flashes)
  for (int i = 0; i < 6; i++) {
    digitalWrite(PIN_LED_NETWORK, HIGH);
    digitalWrite(PIN_LED_PUMP, HIGH);
    digitalWrite(PIN_BUZZER, HIGH);
    delay(70);
    digitalWrite(PIN_LED_NETWORK, LOW);
    digitalWrite(PIN_LED_PUMP, LOW);
    digitalWrite(PIN_BUZZER, LOW);
    delay(70);
  }

  // 1. Wipe our custom NVS namespace
  prefs.begin(NVS_NAMESPACE, false);
  prefs.clear();
  prefs.end();

  // 2. Erase ESP-IDF internal SDK Wi-Fi non-volatile flash storage
  WiFi.disconnect(true, true);
  WiFi.setAutoReconnect(false);

  storedSSID = "";
  storedPass = "";

  Serial.println("[FACTORY RESET] Wipe complete! Rebooting ESP32 into BLE Pairing Mode...\n");
  delay(400);
  ESP.restart();
}

// ==============================================================================
// 9. MQTT & BACKEND HTTP API CLIENT
// ==============================================================================
void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String message = "";
  for (unsigned int i = 0; i < length; i++) message += (char)payload[i];
  Serial.printf("[MQTT RX] Topic: '%s' | Payload: %s\n", topic, message.c_str());

  StaticJsonDocument<512> doc;
  if (deserializeJson(doc, message) == DeserializationError::Ok) {
    const char* action = doc["action"] | doc["command"] | "";
    const char* cmdId = doc["commandId"] | doc["command_id"] | "cmd_local";

    Serial.printf("[MQTT Command RX] Action parsed: '%s' | CmdId: '%s'\n", action, cmdId);

    if (strcasecmp(action, "START_PUMP") == 0 || strcasecmp(action, "PUMP_ON") == 0 || strcasecmp(action, "START") == 0 || strcasecmp(action, "ON") == 0) {
      requestedPumpState = true;
      pendingCmdReason = "MQTT Remote Start";
      pendingCmdId = String(cmdId);
      hasPendingPumpCommand = true;
    } else if (strcasecmp(action, "STOP_PUMP") == 0 || strcasecmp(action, "PUMP_OFF") == 0 || strcasecmp(action, "STOP") == 0 || strcasecmp(action, "OFF") == 0) {
      requestedPumpState = false;
      pendingCmdReason = "MQTT Remote Stop";
      pendingCmdId = String(cmdId);
      hasPendingPumpCommand = true;
    } else if (strcasecmp(action, "SET_MODE") == 0) {
      const char* m = doc["mode"] | doc["parameters"]["mode"] | "AUTO";
      systemMode = String(m);
      systemMode.toUpperCase();
      Serial.printf("[SYSTEM] Mode changed to: %s\n", systemMode.c_str());
      prefs.begin(NVS_NAMESPACE, false);
      prefs.putString("sys_mode", systemMode);
      prefs.end();
      notifyMqttStatusUpdate = true;
    } else if (strcasecmp(action, "SET_RULES") == 0) {
      if (doc.containsKey("autoStartLevel")) autoStartLevel = doc["autoStartLevel"];
      if (doc.containsKey("autoStopLevel")) autoStopLevel = doc["autoStopLevel"];
      if (doc.containsKey("dryRunProtection")) dryRunProtectionEnabled = doc["dryRunProtection"];
      prefs.begin(NVS_NAMESPACE, false);
      prefs.putFloat("auto_start", autoStartLevel);
      prefs.putFloat("auto_stop", autoStopLevel);
      prefs.putBool("dry_run", dryRunProtectionEnabled);
      prefs.end();
      Serial.printf("[SYSTEM] Automation Rules Updated: Start at %.1f%%, Stop at %.1f%%\n", autoStartLevel, autoStopLevel);
      notifyMqttStatusUpdate = true;
    } else if (strcasecmp(action, "TOGGLE_PUMP") == 0 || strcasecmp(action, "TOGGLE") == 0) {
      requestedPumpState = !pumpRunning;
      pendingCmdReason = "MQTT Toggle";
      pendingCmdId = String(cmdId);
      hasPendingPumpCommand = true;
    } else if (strcasecmp(action, "EMERGENCY_STOP") == 0) {
      emergencyStopped = true;
      requestedPumpState = false;
      pendingCmdReason = "MQTT Emergency Stop";
      pendingCmdId = String(cmdId);
      hasPendingPumpCommand = true;
    } else if (strcasecmp(action, "CLEAR_EMERGENCY") == 0) {
      emergencyStopped = false;
      Serial.println("[Safety] Emergency Stop state cleared remotely via MQTT.");
      notifyMqttStatusUpdate = true;
    } else if (strcasecmp(action, "PING") == 0 || strcasecmp(action, "GET_STATUS") == 0 || strcasecmp(action, "STATUS") == 0) {
      Serial.println("[MQTT] Immediate Status request received from App. Dispatching live state...");
      notifyMqttStatusUpdate = true;
    } else if (strcasecmp(action, "FACTORY_RESET") == 0 || strcasecmp(action, "HARD_RESET") == 0) {
      executeFactoryReset();
    }
  }
}

void sendHttpBackendTelemetry() {
  if (WiFi.status() != WL_CONNECTED) return;

  HTTPClient http;
  http.begin(storedBackendUrl);
  http.addHeader("Content-Type", "application/json");
  http.setTimeout(2000);

  StaticJsonDocument<384> doc;
  doc["deviceId"] = deviceId;
  doc["waterLevel"] = (lastSensorPacketTime > 0 && (millis() - lastSensorPacketTime) < SUB_NODE_TIMEOUT_MS) ? currentLevelPct : -1;
  doc["waterVolume"] = currentVolumeL;
  doc["flowRate"] = currentFlowRateLpm;
  doc["temperature"] = currentTempC;
  doc["tds"] = currentTdsPpm;
  doc["battery"] = currentBatteryV;
  doc["pumpState"] = pumpRunning ? "RUNNING" : "STOPPED";
  doc["mode"] = systemMode;
  doc["rssi"] = WiFi.RSSI();

  String payload;
  serializeJson(doc, payload);

  int httpCode = http.POST(payload);
  if (httpCode > 0) {
    Serial.printf("[HTTP API] Telemetry sent (Code: %d)\n", httpCode);
  }
  http.end();
}

// ==============================================================================
// 10. ESP-NOW CENTRAL HUB (INTERRUPT-SAFE & NON-BLOCKING)
// ==============================================================================
volatile bool newSensorPacketAvailable = false;
SensorTelemetryPacket cachedSensorPacket;
portMUX_TYPE sensorMux = portMUX_INITIALIZER_UNLOCKED;

#if defined(ESP_IDF_VERSION) && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void onEspNowDataRecv(const esp_now_recv_info_t *info, const uint8_t *incomingData, int len) {
#else
void onEspNowDataRecv(const uint8_t *mac_addr, const uint8_t *incomingData, int len) {
#endif
  if (len == sizeof(SensorTelemetryPacket)) {
    SensorTelemetryPacket packet;
    memcpy(&packet, incomingData, sizeof(packet));

    if (packet.header == 0xAA55) {
      uint16_t calcCrc = calculateCRC16((uint8_t*)&packet, sizeof(packet) - sizeof(uint16_t));
      if (calcCrc == packet.checksum) {
        portENTER_CRITICAL_ISR(&sensorMux);
        cachedSensorPacket = packet;
        currentLevelPct = packet.waterLevelPct;
        currentVolumeL = packet.waterVolumeL;
        currentFlowRateLpm = packet.flowRateLpm;
        currentTempC = packet.waterTempC;
        currentTdsPpm = packet.tdsPpm;
        currentBatteryV = packet.batteryVoltage;
        lastPacketSeq = packet.sequence;
        lastSensorPacketTime = millis();
        newSensorPacketAvailable = true;
        portEXIT_CRITICAL_ISR(&sensorMux);
      }
    }
  }
}

// ==============================================================================
// 11. FREERTOS CORE 0: TASK NETWORK (Wi-Fi, MQTT, LWT, Heartbeat)
// ==============================================================================
void TaskNetwork(void *pvParameters) {
  unsigned long lastReport = 0;
  unsigned long lastLedToggle = 0;
  bool ledBlinkState = false;

