karthiknataraj547/Water-pump-controller/firmware/arduino_ide/build_esp32/sketch/ESP32_Main_Gateway.ino.cpp
  for (;;) {
    // 0. Handle Asynchronous BLE Wi-Fi Provisioning Request
    if (pendingWifiProvisioning) {
      pendingWifiProvisioning = false;
      Serial.printf("\n[WiFi Manager] Processing BLE Wi-Fi credentials for SSID: '%s'...\n", incomingSsid.c_str());
      
      bool ok = connectWifi(incomingSsid, incomingPass);
      if (ok) {
        Serial.println("[BLE] Connection SUCCESS! Notifying mobile application...");
        updateBleStatus("SUCCESS", WiFi.localIP().toString());
        vTaskDelay(pdMS_TO_TICKS(1200)); // Allow BLE packet to transmit over air
        stopBleProvisioning();
      } else {
        Serial.println("[BLE] Connection FAILED. Notifying mobile application...");
        updateBleStatus("ERROR", "", "Failed to connect to Wi-Fi. Check SSID and Password.");
      }
    }

    if (WiFi.status() != WL_CONNECTED) {
      // Blink Network LED when Wi-Fi is disconnected (500ms interval)
      if (millis() - lastLedToggle > 500) {
        lastLedToggle = millis();
        ledBlinkState = !ledBlinkState;
        digitalWrite(PIN_LED_NETWORK, ledBlinkState ? HIGH : LOW);
      }
      // Reconnect using stored credentials
      if (storedSSID.length() > 0 && millis() - lastMqttRetry > 10000) {
        lastMqttRetry = millis();
        Serial.println("[WiFi] Reconnecting to Wi-Fi...");
        WiFi.reconnect();
      }
      vTaskDelay(pdMS_TO_TICKS(50));
      continue;
    }

    // Wi-Fi Connected: Solid blue network LED
    digitalWrite(PIN_LED_NETWORK, HIGH);

    // MQTT Connection Management
    if (!mqttClient.connected()) {
      if (millis() - lastMqttRetry > 3500) {
        lastMqttRetry = millis();
        const char* targetBroker = CLOUD_BROKERS[currentBrokerIdx];
        mqttClient.setServer(targetBroker, DEFAULT_MQTT_PORT);

        String clientId = deviceId + "_" + String(random(1000, 9999));
        String lwtPayload = "{\"deviceId\":\"" + deviceId + "\",\"status\":\"OFFLINE\",\"subNodeOnline\":false,\"waterLevel\":-1}";

        Serial.printf("[MQTT] Connecting to '%s:1883' with LWT...\n", targetBroker);
        if (mqttClient.connect(clientId.c_str(), "pump/status", 1, true, lwtPayload.c_str())) {
          Serial.printf("[MQTT] Connected to Broker: %s!\n", targetBroker);

          // Subscriptions - single clean subscriptions without wildcards
          String cmdTopic = "pump/" + deviceId + "/command";
          mqttClient.subscribe("pump/command");
          mqttClient.subscribe(cmdTopic.c_str());

          // Send immediate live ONLINE status
          StaticJsonDocument<256> initDoc;
          initDoc["deviceId"] = deviceId;
          initDoc["status"] = "ONLINE";
          initDoc["pumpState"] = pumpRunning ? "RUNNING" : "STOPPED";
          initDoc["mode"] = systemMode;
          bool subAlive = (lastSensorPacketTime > 0 && (millis() - lastSensorPacketTime) < SUB_NODE_TIMEOUT_MS);
          initDoc["subNodeOnline"] = subAlive;
          initDoc["waterLevel"] = subAlive ? currentLevelPct : -1;
          initDoc["waterVolume"] = subAlive ? currentVolumeL : 0;
          initDoc["flowRate"] = subAlive ? currentFlowRateLpm : 0;
          initDoc["tds"] = subAlive ? currentTdsPpm : 0;
          initDoc["ip"] = WiFi.localIP().toString();
          initDoc["rssi"] = WiFi.RSSI();
          String initOut;
          serializeJson(initDoc, initOut);
          mqttClient.publish("pump/status", initOut.c_str(), false);
          mqttClient.publish(("pump/" + deviceId + "/status").c_str(), initOut.c_str(), false);
          Serial.printf("[MQTT] Broadcasted live ONLINE status for %s\n", deviceId.c_str());
        } else {
          Serial.printf("[MQTT] Connect failed (State: %d). Trying next broker in pool...\n", mqttClient.state());
          currentBrokerIdx = (currentBrokerIdx + 1) % 3;
        }
      }
    } else {
      mqttClient.loop();

      // 1. Asynchronous Telemetry Dispatch from Sub Node (High-frequency ~300ms, non-blocking)
      static unsigned long lastTelMqttSend = 0;
      if (newSensorPacketAvailable && (millis() - lastTelMqttSend >= 300)) {
        lastTelMqttSend = millis();
        newSensorPacketAvailable = false;

        SensorTelemetryPacket p;
        portENTER_CRITICAL(&sensorMux);
        p = cachedSensorPacket;
        portEXIT_CRITICAL(&sensorMux);

        StaticJsonDocument<384> telDoc;
        telDoc["deviceId"] = deviceId;
        telDoc["nodeType"] = "SUB_NODE";
        telDoc["subNodeId"] = p.nodeId;
        telDoc["sequence"] = p.sequence;
        telDoc["waterLevel"] = p.waterLevelPct;
        telDoc["waterVolume"] = p.waterVolumeL;
        telDoc["flowRate"] = p.flowRateLpm;
        telDoc["temperature"] = p.waterTempC;
        telDoc["tds"] = p.tdsPpm;
        telDoc["battery"] = p.batteryVoltage;
        telDoc["pumpState"] = pumpRunning ? "RUNNING" : "STOPPED";
        telDoc["mode"] = systemMode;
        telDoc["timestamp"] = millis();

        String telJson;
        serializeJson(telDoc, telJson);
        mqttClient.publish("pump/telemetry", telJson.c_str(), false);
        mqttClient.publish(("pump/" + deviceId + "/telemetry").c_str(), telJson.c_str(), false);
        mqttClient.publish(("devices/" + deviceId + "/telemetry").c_str(), telJson.c_str(), false);
      }

      // 2. Asynchronous Status and ACK Dispatch
      if (notifyMqttStatusUpdate) {
        notifyMqttStatusUpdate = false;
        StaticJsonDocument<256> doc;
        doc["deviceId"] = deviceId;
        doc["nodeType"] = "MAIN_NODE";
        doc["status"] = "ONLINE";
        doc["pumpState"] = pumpRunning ? "RUNNING" : "STOPPED";
        doc["mode"] = systemMode;
        bool subAlive = (lastSensorPacketTime > 0 && (millis() - lastSensorPacketTime) < SUB_NODE_TIMEOUT_MS);
        doc["subNodeOnline"] = subAlive;
        doc["ip"] = WiFi.localIP().toString();
        doc["rssi"] = WiFi.RSSI();
        doc["timestamp"] = millis();
        String out;
        serializeJson(doc, out);
        mqttClient.publish("pump/status", out.c_str(), false);
        mqttClient.publish("pump/heartbeat", out.c_str(), false);
        mqttClient.publish(("pump/" + deviceId + "/status").c_str(), out.c_str(), false);

        if (pendingCmdId.length() > 0) {
          StaticJsonDocument<256> ack;
          ack["commandId"] = pendingCmdId;
          ack["command"] = pendingCmdReason;
          ack["status"] = "SUCCESS";
          ack["pumpStatus"] = pumpRunning ? "ON" : "OFF";
          ack["pumpState"] = pumpRunning ? "RUNNING" : "STOPPED";
          ack["mode"] = systemMode;
          ack["emergencyStopped"] = emergencyStopped;
          ack["timestamp"] = millis();
          String ackStr;
          serializeJson(ack, ackStr);
          mqttClient.publish("pump/command/ack", ackStr.c_str());
          mqttClient.publish(("pump/" + deviceId + "/command/ack").c_str(), ackStr.c_str());
          pendingCmdId = "";
        }
      }

      // 3. Dedicated Main Node Heartbeat (every 2.0 seconds)
      if (millis() - lastReport > STATUS_REPORT_INTERVAL) {
        lastReport = millis();
        StaticJsonDocument<256> doc;
        doc["deviceId"] = deviceId;
        doc["nodeType"] = "MAIN_NODE";
        doc["status"] = "ONLINE";
        doc["pumpState"] = pumpRunning ? "RUNNING" : "STOPPED";
        doc["mode"] = systemMode;
        bool subAlive = (lastSensorPacketTime > 0 && (millis() - lastSensorPacketTime) < SUB_NODE_TIMEOUT_MS);
        doc["subNodeOnline"] = subAlive;
        doc["ip"] = WiFi.localIP().toString();
        doc["rssi"] = WiFi.RSSI();
        doc["timestamp"] = millis();
        String out;
        serializeJson(doc, out);
        mqttClient.publish("pump/status", out.c_str(), false);
        mqttClient.publish("pump/heartbeat", out.c_str(), false);
        mqttClient.publish(("devices/" + deviceId + "/heartbeat").c_str(), out.c_str(), false);
        mqttClient.publish(("pump/" + deviceId + "/status").c_str(), out.c_str(), false);
      }
    }

    vTaskDelay(pdMS_TO_TICKS(50));
  }
}

// ==============================================================================
// 12. FREERTOS CORE 1: TASK CONTROL (Manual Button, Relay, Reset, Safety Engine)
// ==============================================================================
void TaskControl(void *pvParameters) {
  int bootBtnCounter = 0;
  int emergencyCounter = 0;
  int manualBtnCounter = 0;
  bool manualBtnLatched = false;

