karthiknataraj547/Water-pump-controller/firmware/arduino_ide/build_esp32/sketch/ESP32_Main_Gateway.ino.cpp
  for (;;) {
    // 0. Execute Pending Remote Pump Command from MQTT or App
    if (hasPendingPumpCommand) {
      hasPendingPumpCommand = false;
      setPumpState(requestedPumpState, pendingCmdReason);
    }
    // 1. Hard Reset Button Handler (BOOT / GPIO 0 - Hold 1.5s with bounce immunity)
    if (digitalRead(PIN_HARD_RESET) == LOW) {
      bootBtnCounter++;
      if (bootBtnCounter == 1) {
        Serial.println("[RESET BTN] BOOT button pressed. Hold for 1.5s to Factory Reset...");
      } else if (bootBtnCounter % 6 == 0) {
        Serial.printf("[RESET BTN] Holding BOOT button... (%d ms / 1500 ms)\n", bootBtnCounter * 50);
      }
      if (bootBtnCounter >= 30) { // 30 * 50ms = 1500ms
        executeFactoryReset();
      }
    } else {
      if (bootBtnCounter > 0) bootBtnCounter -= 2; // Smooth decay prevents contact bounce resets
      if (bootBtnCounter < 0) bootBtnCounter = 0;
    }

    // 2. Serial Monitor Reset Command Listener
    if (Serial.available()) {
      String cmd = Serial.readStringUntil('\n');
      cmd.trim();
      if (cmd.equalsIgnoreCase("reset") || cmd.equalsIgnoreCase("factory")) {
        executeFactoryReset();
      } else if (cmd.equalsIgnoreCase("pump on") || cmd.equalsIgnoreCase("on")) {
        setPumpState(true, "Serial Command");
      } else if (cmd.equalsIgnoreCase("pump off") || cmd.equalsIgnoreCase("off")) {
        setPumpState(false, "Serial Command");
      } else if (cmd.equalsIgnoreCase("auto")) {
        systemMode = "AUTO";
        Serial.println("[SYSTEM] Mode changed to AUTO");
      } else if (cmd.equalsIgnoreCase("manual")) {
        systemMode = "MANUAL";
        Serial.println("[SYSTEM] Mode changed to MANUAL");
      }
    }

    // 3. Hardware Emergency Stop Switch (Requires sustained 250ms LOW to prevent false trips from inductive relay noise)
    if (digitalRead(PIN_EMERGENCY_STOP) == LOW) {
      emergencyCounter++;
      if (emergencyCounter >= 5) { // 5 * 50ms = 250ms continuous LOW
        if (!emergencyStopped) {
          emergencyStopped = true;
          setPumpState(false, "Hardware Emergency Button Pressed");
        }
      }
    } else {
      emergencyCounter = 0;
    }

    // 4. Manual Switching Push Button (Debounced toggle - requires sustained 150ms press)
    if (digitalRead(PIN_MANUAL_BUTTON) == LOW) {
      manualBtnCounter++;
      if (manualBtnCounter >= 3 && !manualBtnLatched) {
        manualBtnLatched = true;
        setPumpState(!pumpRunning, "Manual Physical Toggle Button");
      }
    } else {
      manualBtnCounter = 0;
      manualBtnLatched = false;
    }

    // 5. Autonomous Automation & Safety Engine
    bool subAlive = (lastSensorPacketTime > 0 && (millis() - lastSensorPacketTime) < SUB_NODE_TIMEOUT_MS);
    if (systemMode == "AUTO" && subAlive && currentLevelPct >= 0.0f) {
      // High Level Cutoff
      if (pumpRunning && currentLevelPct >= autoStopLevel) {
        setPumpState(false, "Tank High Level Cutoff (" + String(currentLevelPct, 1) + "%)");
      }
      // Low Level Auto Refill
      if (!pumpRunning && currentLevelPct <= autoStartLevel && !emergencyStopped) {
        setPumpState(true, "Tank Low Level Auto Refill (" + String(currentLevelPct, 1) + "%)");
      }
    }

    // 6. Max Continuous Runtime Safety Cutoff (30 minutes)
    if (pumpRunning && (millis() - pumpStartTime > MAX_RUN_TIME_LIMIT_MS)) {
      setPumpState(false, "Continuous Max Run Time Limit Reached (30 Mins)");
    }

    vTaskDelay(pdMS_TO_TICKS(50));
  }
}

// ==============================================================================
// 13. SYSTEM INITIALIZATION & MAIN SETUP
// ==============================================================================
void setup() {
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); // Disable brownout detector to prevent reboot on power sag

  Serial.begin(115200);
  delay(500);
  Serial.println("\n=======================================================");
  Serial.println("   HydroPulse ESP32 Gateway Node Booting (v2.0.0)");
  Serial.println("=======================================================");

  // Pin Configurations
  pinMode(PIN_RELAY_PUMP, OUTPUT);
  pinMode(PIN_LED_NETWORK, OUTPUT);
  pinMode(PIN_LED_PUMP, OUTPUT);
  pinMode(PIN_BUZZER, OUTPUT);
  pinMode(PIN_EMERGENCY_STOP, INPUT_PULLUP);
  pinMode(PIN_MANUAL_BUTTON, INPUT_PULLUP);
  pinMode(PIN_HARD_RESET, INPUT_PULLUP);

  // Initialize all outputs to safe OFF state
  digitalWrite(PIN_RELAY_PUMP, RELAY_ACTIVE_LOW ? HIGH : LOW);
  digitalWrite(PIN_LED_PUMP, LOW);
  digitalWrite(PIN_BUZZER, LOW);

  // Diagnostic: Print hardware reset reason
  esp_reset_reason_t rst_reason = esp_reset_reason();
  const char* rst_str = "NORMAL BOOT";
  switch (rst_reason) {
    case ESP_RST_POWERON:   rst_str = "POWER ON (Cold Boot)"; break;
    case ESP_RST_SW:        rst_str = "SOFTWARE RESTART"; break;
    case ESP_RST_PANIC:     rst_str = "EXCEPTION / CRASH"; break;
    case ESP_RST_BROWNOUT:  rst_str = "BROWNOUT (Voltage dipped below 2.5V from motor surge!)"; break;
    default: break;
  }
  Serial.printf("[SYSTEM] Reset Reason: %s (Code: %d)\n", rst_str, rst_reason);

  // Load Saved Configuration from NVS
  prefs.begin(NVS_NAMESPACE, false);
  systemMode = prefs.getString("sys_mode", "AUTO");
  autoStartLevel = prefs.getFloat("auto_start", 25.0f);
  autoStopLevel = prefs.getFloat("auto_stop", 95.0f);
  dryRunProtectionEnabled = prefs.getBool("dry_run", true);
  prefs.end();

  Serial.printf("[SYSTEM] Mode: %s | Auto-Start: %.0f%% | Auto-Stop: %.0f%%\n",
                systemMode.c_str(), autoStartLevel, autoStopLevel);

  // Instant Power-On Reset Check (Hold BOOT button at power-on for 1.2s)
  if (digitalRead(PIN_HARD_RESET) == LOW) {
    Serial.println("[BOOT] BOOT button pressed at power-on! Hold 1.2s for Factory Reset...");
    unsigned long bootPressStart = millis();
    while (digitalRead(PIN_HARD_RESET) == LOW) {
      delay(40);
      if (millis() - bootPressStart >= 1200) {
        executeFactoryReset();
      }
    }
    Serial.println("[BOOT] BOOT button released. Proceeding with standard boot.");
  }

  // 1. Wi-Fi & ESP-NOW Setup
  WiFi.mode(WIFI_AP_STA);
  WiFi.setSleep(false); // Disable modem sleep to prevent radio drops
  esp_wifi_set_ps(WIFI_PS_NONE);

  // Generate Unique Device ID from Hardware MAC Address
  uint8_t mac[6];
  WiFi.macAddress(mac);
  char devIdBuf[32];
  snprintf(devIdBuf, sizeof(devIdBuf), "%s%02X%02X%02X", DEFAULT_DEVICE_PREFIX, mac[3], mac[4], mac[5]);
  deviceId = String(devIdBuf);

  Serial.printf("[SYSTEM] Device ID: %s | Hardware MAC: %02X:%02X:%02X:%02X:%02X:%02X\n",
                deviceId.c_str(), mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

  if (esp_now_init() == ESP_OK) {
    Serial.println("[ESP-NOW] Subsystem initialized successfully!");
    esp_now_register_recv_cb(onEspNowDataRecv);

    // Register Broadcast Peer for ESP8266 Sub Node
    esp_now_peer_info_t peerInfo = {};
    memset(&peerInfo, 0, sizeof(peerInfo));
    for (int i = 0; i < 6; i++) peerInfo.peer_addr[i] = 0xFF;
    peerInfo.channel = 0; // Receive on any channel
    peerInfo.encrypt = false;
    if (esp_now_add_peer(&peerInfo) == ESP_OK) {
      Serial.println("[ESP-NOW] Broadcast peer registered (Listening for ESP8266 Sub Nodes).");
    }
  } else {
    Serial.println("[ESP-NOW] ERROR: Init Failed!");
  }

