karthiknataraj547/Water-pump-controller/firmware/arduino_ide/build_esp32/sketch/ESP32_Main_Gateway.ino.cpp
  Serial.printf("[WiFi] Initial Radio Channel: %d\n", WiFi.channel());

  // 2. Read Stored Wi-Fi from Flash NVS
  prefs.begin(NVS_NAMESPACE, false);
  storedSSID = prefs.getString("wifi_ssid", "");
  storedPass = prefs.getString("wifi_pass", "");
  prefs.end();

  bool wifiAutoConnected = false;
  if (storedSSID.length() > 0) {
    Serial.printf("[NVS] Found saved Wi-Fi: '%s'. Auto-connecting...\n", storedSSID.c_str());
    wifiAutoConnected = connectWifi(storedSSID, storedPass);
    Serial.printf("[WiFi] Post-Connect Radio Channel: %d\n", WiFi.channel());
  }

  // 3. Start BLE Provisioning only if Wi-Fi is not connected
  if (!wifiAutoConnected) {
    Serial.println("[BLE] Wi-Fi not connected. Starting BLE Provisioning server for app pairing...");
    startBleProvisioning();
  } else {
    Serial.println("[BLE] Saved Wi-Fi connected directly. BLE Provisioning bypassed.");
  }

  // 4. MQTT Client Setup
  mqttClient.setServer(DEFAULT_MQTT_BROKER, DEFAULT_MQTT_PORT);
  mqttClient.setCallback(mqttCallback);
  mqttClient.setBufferSize(512);
  mqttClient.setKeepAlive(30);

  // 5. Spawn FreeRTOS Dual-Core Tasks
  xTaskCreatePinnedToCore(TaskNetwork, "NetTask", 8192, NULL, 1, &TaskNetworkHandle, 0); // Core 0
  xTaskCreatePinnedToCore(TaskControl, "CtrlTask", 8192, NULL, 2, &TaskControlHandle, 1); // Core 1

  Serial.println("=======================================================");
  Serial.println(">> SYSTEM READY!");
  Serial.println(">> PUMP RELAY: GPIO 23 | MANUAL BUTTON: GPIO 19 | EMERGENCY: GPIO 18");
  Serial.println(">> FACTORY RESET: Hold BOOT (GPIO 0) for 1.5s or type 'reset' in Serial.");
  Serial.println("=======================================================\n");
}

void loop() {
  vTaskDelay(pdMS_TO_TICKS(1000));
}

